---
kind: enumMember
id: F:Autodesk.Revit.DB.DirectContext3D.PrimitiveType.PointList
enum: Autodesk.Revit.DB.DirectContext3D.PrimitiveType
source: html/f0b47a17-85be-d631-10c1-76358114f7dc.htm
---
# Autodesk.Revit.DB.DirectContext3D.PrimitiveType.PointList

Geometry consisting of a list of points.